<?php

namespace Database\Seeders;

use App\Models\League;
use App\Models\Team;
use Illuminate\Database\Seeder;

class TeamSeeder extends Seeder
{
    protected $data = [
        'პრემიერ ლიგა' => [
            'მანჩესტერ სიტი',
            'ლივერპული',
            'ჩელსი',
            'არსენალი',
            'მანჩესტერ იუნაიტედი',
            'ვესტ ჰემი',
            'ვულვზი',
            'ტოტენჰემი',
            'ასტონ ვილა',
            'საუსჰემპტონი',
            'კრისტალ პალასი',
            'ლესტერი',
            'ბრაიტონი',
            'ნიუკასლ იუნაიტედი',
            'ბრენტფორდი',
            'ლიდსი',
            'ევერტონი',
            'უოტფორდი',
            'ბარნლი',
            'ნორვიჩი',
        ],
        'ლა ლიგა' => [
            'რეალ მადრიდი',
            'სევილია',
            'ბარსელონა',
            'ატლეტიკო მადრიდი',
            'ბეტისი',
            'რეალ სოსიედადი',
            'ვილიარეალი',
            'ატლეტიკ ბილბაო',
            'ვალენსია',
            'სელტა ვიგო',
            'ოსასუნა',
            'ესპანიოლი',
            'რაიო ვალეკანო',
            'ელჩე',
            'ხეტაფე',
            'მალიორკა',
            'გრანადა',
            'კადიზი',
            'ალავესი',
            'ლევანტე',
        ],
        'ბუნდეს ლიგა' => [
            'მიუნხენის ბაიერნი',
            'დორტმუნდი',
            'ლევერკუზენი',
            'ლაიპციგი',
            'ფრაიბურგი',
            'ჰოფენჰაიმი',
            'კიოლნი',
            'უნიონ ბერლინი',
            'აინტრახტი',
            'მაინცი',
            'ბოხუმი',
            'ვოლფსბურგი',
            'გლდაბახი',
            'აუგსბურგი',
            'არმინია ბილეფელდი',
            'შტუტგარტი',
            'ჰერტა',
            'გროიტერ ფიურტი',
        ],
        'სერია ა' => [
            'მილანი',
            'ნაპოლი',
            'ინტერი',
            'იუვენტუსი',
            'ლაციო',
            'რომა',
            'ატალანტა',
            'ფიორენტინა',
            'ვერონა',
            'სასოულო',
            'ტორინო',
            'ბოლონია',
            'ემპოლი',
            'უდინეზე',
            'სპეცია',
            'სამპდორია',
            'კალიარი',
            'ვენეცია',
            'ჯენოა',
            'სალერნიტანა',
        ],
        'საფრანგეთის ლიგა 1' => [
            'პსჟ',
            'მარსელი',
            'ნიცა',
            'რენი',
            'სტრასბურგი',
            'ლილი',
            'ნანტი',
            'მონაკო',
            'ლანსი',
            'ლიონი',
            'მონპელიე',
            'რეიმსი',
            'ბრესტი',
            'ანჟე',
            'ტრუა',
            'კლერმონი',
            'ლორიანი',
            'სტ. ეტიენი',
            'მეცი',
            'ბორდო',
        ],
    ];

    public function run()
    {
        foreach ($this->data as $league => $teams){
            $league = League::updateOrCreate(['name' => $league],[
                'name' => $league,
                'type' => 'football'
            ]);
            foreach ($teams as $team){
                $team = Team::firstOrCreate(['name' => $team]);
                if (! $team->leagues()->where('league_id', $league->id)->exists()){
                    $team->leagues()->attach($league->id);
                }
            }
        }
    }
}
